Repository: WhiteFossa/floader-avr
Catalog: Client/FloaderClientGUI/GUI/Resources/Language.*.resx
Languages: ru

# AppName
source: Fossa's AVR loader
ru: AVR загрузчик Фоссы

# AppVersion
source: 0.0.3 (7 November 2020)
ru: 0.0.2 (24 Окт 2020)

# Baudrate
source: Baudrate: {0}
ru: Скорость: {0}

# DataBits
source: Data bits: {0}
ru: Биты данных: {0}

# DeviceIdentified
source: Device identified: Version: {0}, Vendor ID: {1}, Model ID: {2}, Serial number: {3}.
ru: Устройство опознано: Версия: {0}, Идентификатор производителя: {1}, Идентификатор модели: {2}, Серийный номер: {3}.

# GenericWrongDeviceResponseTitle
source: Wrong device response
ru: Некорректный ответ от устройства

# IdentificationTimeout
source: Attempt to identify device timed out. Check port and device state - it must be in bootloader mode.
ru: Время на идентификацию устройства вышло. Проверьте порт и состояние устройства - оно должно быть в режиме загрузчика.

# IdentificationTimeoutTitle
source: Identification timeout
ru: Таймаут идентификации

source: Interface already locked.
ru: Интерфейс уже заблокирован.

source: Interface already unlocked.
ru: Интерфейс уже разблокирован.

# LocBtnDownload
source: Download
ru: Скачать

# LocBtnPoll
source: Poll
ru: Опросить

# LocBtnReboot
source: Reboot
ru: Перезагрузить

# LocBtnSelectPort
source: Select port
ru: Выбрать порт

# LocBtnUpload
source: Upload
ru: Загрузить

# LocButtonCancel
source: Cancel
ru: Отмена

# LocButtonOK
source: OK
ru: ОК

# LocButtonRefresh
source: Refresh
ru: Обновить

# LocButtonReset
source: Reset
ru: Сброс

# LocGroupboxAbout
source: About:
ru: О программе:

# LocGroupboxAdvancedOptions
source: Advanced options:
ru: Продвинутые настройки:

# LocGroupboxConsole
source: Console:
ru: Консоль:

# LocGroupboxDevice
source: Device:
ru: Устройство:

# LocGroupboxDownload
source: Download:
ru: Скачать:

# LocGroupboxPort
source: Port:
ru: Порт:

# LocGroupboxPortsList
source: Ports list:
ru: Список портов:

# LocGroupboxProgress
source: Progress:
ru: Прогресс:

# LocGroupboxUpload
source: Upload:
ru: Загрузить:

# LocTextAbout
source: About
ru: О программе

# LocTextAuthors1
source: By White Fossa aka Artyom Vetrov
ru: Написан Белой Фоссой ака Артёмом Ветровым

# LocTextAuthors2
source: and contributors.
ru: и другими участниками.

# LocTextBackups
source: Backups:
ru: Бэкапы:

# LocTextBaudrate
source: Baudrate:
ru: Скорость:

# LocTextDataBits
source: Data bits:
ru: Биты данных:

# LocTextLicense
source: License:
ru: Лицензия:

# LocTextLicenseText
source: License text:
ru: Текст лицензии:

# LocTextModel
source: Model:
ru: Модель:

# LocTextOperation
source: Operation:
ru: Операция:

# LocTextOrLaterVersion
source: or later version by your choice.
ru: или более поздняя версия, на ваш выбор.

# LocTextOverrideDefaults
source: Override defaults?
ru: Переопределить умолчания?

# LocTextParity
source: Parity:
ru: Чётность:

# LocTextPort
source: Port:
ru: Порт:

# LocTextSelectBackupsDirectory
source: Select backups directory
ru: Выберите директорию для бэкапов

# LocTextSelectEepromHexFile
source: Select EEPROM HEX file
ru: Выберите HEX файл с EEPROM

# LocTextSelectFlashHexFile
source: Select FLASH HEX file
ru: Выберите HEX файл с FLASH

# LocTextSerial
source: Serial number:
ru: Серийный номер:

# LocTextSoftwareDescription
source: Crossplatform bootloader for AVR MCUs.
ru: Кроссплатформенный загрузчик для МК AVR.

# LocTextSources
source: Sources:
ru: Исходники:

# LocTextStopBits
source: Stop bits:
ru: Стоповые биты:

# LocTextVendor
source: Vendor:
ru: Производитель:

# LocTextWriteEepromIntoThisFile
source: Write EEPROM HEX into this file
ru: Записать EEPROM в этот HEX файл

# LocTextWriteFlashIntoThisFile
source: Write FLASH HEX into this file
ru: Записать FLASH в этот HEX файл

# LoggerError
source: [{0}] Error: {1}
ru: [{0}] Ошибка: {1}

# LoggerInfo
source: [{0}] Info: {1}
ru: [{0}] Инфо: {1}

# LoggerWarning
source: [{0}] Warning: {1}
ru: [{0}] Внимание: {1}

# ModelNameInfo
source: Vendor ID={0}, Model ID={1}, Model name="{2}".
ru: Vendor ID={0}, Model ID={1}, Модель="{2}".

# ModelNotFound
source: Device model with Vendor ID={0} and ModelID={1} wasn't found in database.
ru: Устройство с Vendor ID={0} и ModelID={1} не найдено в базе данных.

# ModelNotFoundTitle
source: Unknown model
ru: Неизвестная модель устройства

# NoOperationInProgress
source: None
ru: Нет

# NotReady
source: Not ready to proceed!
ru: Нет готовности!

# Parity
source: Parity: {0}
ru: Чётность: {0}

# Port
source: Port: {0}
ru: Порт: {0}

source: Port not selected!
ru: Порт не выбран!

source: Port settings:
ru: Настройки порта:

# QueryingDeviceName
source: Querying device name data for Vendor ID={0}, Model ID={1}.
ru: Запрашиваю название устройства для Vendor ID={0}, Model ID={1}.

# QueryingVendorData
source: Queriying vendor data for Vendor ID={0}.
ru: Запрашиваю данные производителя для Vendor ID={0}.

# StopBits
source: Stop bits: {0}
ru: Стоповые биты: {0}

# UnableToProceed
source: Unable to proceed! Please, select another device.
ru: Невозможно продолжать! Пожалуйста, выберите другое устройство.

# UnexpectedIdentificationResponse
source: Device responded to identification request in unusual way, probably it's not Fossa's bootloader device. Check port and device state - it must be in bootloader mode.
ru: Устройство ответило на запрос идентификации необычным образом, вероятно это НЕ устройство с загрузчиком Фоссы. Проверьте порт и состояние устройства - оно должно быть в режиме загрузчика.

# UnsuccessfullReboot
source: Device didn't report reboot. Check manually did it reboot or not.
ru: Устройство не сообщило о перезагрузке. Проверьте, перезагрузилось оно или нет.

# UnsuccessfullRebootTitle
source: Reboot is unsuccessfull
ru: Перезагрузка неуспешна

# UnsupportedBootloaderProtocolVersion
source: Bootloader protocol version {0} is not supported.
ru: {0}ая версия протокола загрузчика не поддерживается.

# UnsupportedBootloaderProtocolVersionTitle
source: Unsupported protocol version
ru: Неподдерживаемая версия протокола

source: Unsupported OS.
ru: Операционная система не поддерживается.

# VendorNameInfo
source: Vendor ID={0}, Vendor name="{1}".
ru: Vendor ID={0}, Производитель="{1}".

# VendorNotFound
source: Vendor with ID={0} wasn't found in database.
ru: Производитель с ID={0} не найден в базе данных.

# VendorNotFoundTitle
source: Unknown vendor
ru: Неизвестный производитель
