Repository: WhiteFossa/floader-avr
Catalog: Client/FloaderClientGUI/LibFloaderClient/Implementations/Resources/Language.*.resx
Languages: ru

# AddressOutsideEeprom
source: Given EEPROM file contains data for addressess outside EEPROM. Check file correctness.
ru: Заданный файл EEPROM содержит данные за пределами адресного пространства EEPROM. Проверьте корректность файла.

# AllowedFlashPageAddresses
source: Allowed FLASH page addresses: [0 - {0}].
ru: Допустимые адреса страниц FLASH: [0 - {0}].

source: Already disposed.
ru: Уже уничтожено.

# AssemblyNotFound
source: Assembly {0} not found.
ru: Сборка {0} не найдена.

source: Backing up...
ru: Создание резервной копии...

source: Backups directory must be specified.
ru: Не задана директория для бэкапов.

source: Done
ru: Готово

source: Download completed
ru: Скачивание завершено

# DownloadedWritingInto
source: Downloaded. Writting to file...
ru: Скачано, пишу в файл...

# DownloadingEepromInto
source: Downloading EEPROM into {0}...
ru: Скачиваю EEPROM в {0}...

# DownloadingFlashInto
source: Downloading FLASH into {0}...
ru: Скачиваю FLASH в {0}...

# EepromBackupFile
source: EEPROM backup file: {0}
ru: Файл резервной копии EEPROM: {0}

# EepromFileToDownloadMustBeSpecified
source: EEPROM file to download into must be specified.
ru: Не задан файл для скачивания EEPROM.

# EepromReadTimeout
source: Timeout during EEPROM read.
ru: Таймаут во время чтения EEPROM.

# EepromSize
source: EEPROM size: {0} bytes
ru: Размер EEPROM: {0} байт

# EepromWriteByteUnexpectedResponse
source: Unexpected write EEPROM byte response.
ru: Неожиданный ответ при записи байта EEPROM.

# EepromWriteByteUnexpectedResponseSize
source: Unexpected write EEPROM byte response size: {0} bytes.
ru: Неожиданный размер ответа при записи байта EEPROM: {0} байт.

# EepromWriteDontAcceptData
source: Device don't accept new data after writing {0} / {1} bytes.
ru: Устройство не принимает новые данные после записи {0} / {1} байт.

# EepromWriteGreedyDevice
source: Device wants more data after writing the last byte of EEPROM.
ru: Устройство всё ещё хочет данные после записи последнего байта EEPROM.

# FlashAndEepromMustDiffer
source: FLASH and EEPROM files must differ.
ru: Файлы FLASH и EEPROM должны отличаться.

# FlashBackupFile
source: FLASH backup file: {0}
ru: Файл резервной копии FLASH: {0}

# FlashFileToDownloadMustBeSpecified
source: FLASH file to download into must be specified.
ru: Не задан файл для скачивания FLASH.

# FlashOrEepromMustBeSpecified
source: At least either FLASH or EEPROM files must be specified.
ru: Как минимум один из файлов - FLASH или EEPROM - должен быть задан.

# FlashPageSize
source: FLASH page size: {0} bytes
ru: Размер страницы FLASH: {0} байт

# FlashPageVerificationFailed
source: FLASH page {0} verification failed.
ru: Проверка страницы FLASH {0} не прошла.

# FlashReadFailure
source: Device reports failure during FLASH page {0} read.
ru: Устройство сообщает об отказе во время чтения {0} страницы FLASH.

# FlashReadTimeout
source: Timeout during FLASH read.
ru: Таймаут во время чтения страницы FLASH.

# FlashReadUnexpectedResponse
source: Unexpected response to FLASH page {0} read initiation.
ru: Неожиданный ответ на инициацию чтения {0} страницы FLASH.

# FlashReadUnexpectedResponseSize
source: Unexpected response size to FLASH page read request: {0} bytes.
ru: Неожиданный размер ответа на запрос чтения страницы FLASH: {0} байт.

# FlashWriteAddressCheckUnexpectedResponse
source: Unexpected response to FLASH page {0} write address check.
ru: Неожиданный ответ при проверке адреса {0} страницы FLASH.

# FlashWriteFailure
source: Device reports failure during FLASH page write.
ru: Устройство сообщает об отказе при записи страницы FLASH.

# FlashWriteIncorrectPageAddress
source: Device reports incorrect FLASH page address {0} while attempt to write.
ru: Устройство сообщает о некорректном адресе страницы FLASH {0} во время попытки записи.

# FlashWriteTimeout
source: Timeout during FLASH write.
ru: Таймаут во время записи страницы FLASH.

# FlashWriteUnexpectedAddressCheckResponseSize
source: Unexpected response size to FLASH page write address check request: {0} bytes.
ru: Неожиданный размер ответа на запрос проверки адреса страницы FLASH: {0} байт.

# FlashWriteUnexpectedResponseSize
source: Unexpected response size to FLASH page write request: {0} bytes.
ru: Неожиданный размер ответа на запрос записи страницы FLASH: {0} байт.

# FlashWriteWriteableAddressess
source: Writeable page addresses: [0 - {0}].
ru: Страницы FLASH, доступные на запись: [0 - {0}].

# FlashWriteWrongPageSize
source: Expected FLASH page data size is {0} bytes.
ru: Ожидаемый размер страницы FLASH: {0} байт.

source: Getting version-specific data...
ru: Получение данных, специфических для версии...

source: Incorrect position.
ru: Некорректная позиция.

# IOError
source: During IO {0} error happened.
ru: Ошибка ввода-вывода: {0}.

source: Multiple read timeout.
ru: Таймаут множественного чтения.

# NotSetUpDIOProvider
source: Attempt to use not set up Device Independent Operations Provider
ru: Попытка использовать ненастроенный независимый от устройства провайдер операций

# ParityEven
source: Even
ru: Чётный

# ParityMark
source: Mark
ru: Метка

# ParityNone
source: No parity control
ru: Без контроля

# ParityOdd
source: Odd
ru: Нечётный

# ParitySpace
source: Space
ru: Пробел

source: Port isn't open.
ru: Порт не открыт

# PositionIsOutsideResponse
source: Position is outside of the response.
ru: Позиция за пределами ответа.

# ProgressOperationReadingEeprom
source: Reading EEPROM
ru: Чтение EEPROM

# ProgressOperationReadingFlash
source: Reading FLASH
ru: Чтение FLASH

# ProgressOperationWritingEeprom
source: Writing EEPROM
ru: Запись EEPROM

# ProgressOperationWritingFlash
source: Writing FLASH
ru: Запись FLASH

source: Reading EEPROM...
ru: Читаю EEPROM...

# ReadingFlash
source: Reading FLASH (bootloader included)...
ru: Читаю FLASH (включая загрузчик)...

source: Requesting reboot...
ru: Запрашиваю перезагрузку...

# ResourceNotFound
source: Resource {0} not found.
ru: Ресурс {0} не найден.

source: Single read timeout.
ru: Таймаут одиночного чтения.

# StopBitsOne
source: One
ru: Один

# StopBitsOnePointFive
source: One and half
ru: Полтора

# StopBitsTwo
source: Two
ru: Два

# TimeoutOnReboot
source: Device didn't respond in time, check did it reboot manually.
ru: Устройство не ответило вовремя, проверьте, перезагрузилось-ли оно.

# TotalFlashPages
source: Total FLASH pages: {0}
ru: Всего страниц FLASH: {0}

# UnableToGetDeviceData
source: Unable to get device data for VendorId={0}, ModelId={1}
ru: Не удалось получить информацию об устройстве для VendorId={0}, ModelId={1}

# UnknownDeviceResponceOnReboot
source: Device returned unknown response: {0}
ru: Устройство вернуло неизвестный ответ: {0}

# UnsupportedVersion
source: Unsupported version {0}.
ru: Неподдерживаемая версия {0}.

source: Uploading EEPROM...
ru: Загружаю EEPROM...

source: Uploading FLASH...
ru: Загружаю FLASH...

# VersionMustBeOne
source: Version must be 1.
ru: Версия должна быть равна 1.

# VersionOneDetected
source: Version 1 detected
ru: Обнаружена версия 1

# WriteableFlashPages
source: Writeable FLASH pages: {0}
ru: Страниц FLASH, доступных на запись: {0}

source: Write timeout.
ru: Таймаут записи.

source: Writing EEPROM...
ru: Пишу EEPROM...

# WritingFlash
source: Writing FLASH (except bootloader)...
ru: Пишу FLASH (исключая загрузчик)...

# WrongEepromDataSize
source: Data to write size must equal EEPROM size: {0} bytes.
ru: Данные для записи в EEPROM должны иметь размер, равный размеру EEPROM: {0} байт.

# WrongIdentificationResponseLength
source: Identification response must be {0} bytes long.
ru: Ответ на запрос идентификации должен быть {0} байт длиной.
